Documents/ПоручениеНаПереоценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаПереоценку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПорученияНаПереоценку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьЦенныеБумаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьДепозиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьМНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВосстанавливатьРезервПоРасчетнымБрокерскимИКлиринговымСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПорученияНаПереоценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПорученияНаПереоценку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПереоценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовДляПорученийНаПереоценку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Опционы</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыАктивовДляПорученийНаПереоценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАктивовДляПорученийНаПереоценку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныеВклады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервПоРасчетнымБрокерскимИКлиринговымСчетам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКодовВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКодовВТорговыхСистемах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSBoard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодВДепозитарии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CFI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБКраткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSStandart</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеНаПереоценку/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьДвижениеПорученияНаПереоценку(ВидАктива, Рынок = Неопределено, ЦеннаяБумага = Неопределено)

	Движение = Движения.ПорученияНаПереоценку.Добавить();
	
	Движение.Организация					= ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
	Если Рынок = Неопределено Тогда
		Движение.Рынок						= ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка");
	Иначе
		Движение.Рынок						= Рынок;
	КонецЕсли;
	Движение.ЦеннаяБумага					= ЦеннаяБумага;
	Движение.ДатаПереоценки					= НачалоДня(ЭтотОбъект.Дата);
	Движение.ВидУчета						= ЭтотОбъект.ВидУчета;
	Движение.ВидАктива						= ВидАктива;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПорученияНаПереоценку.Записывать = Истина;
	Движения.ПорученияНаПереоценку.Очистить();
	
	Если ЭтотОбъект.ПереоцениватьЦенныеБумаги Тогда
		Если ЭтотОбъект.ЦенныеБумаги.Количество() = 0 Тогда
			ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.ЦенныеБумаги);
		Иначе	
			Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
				ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.ЦенныеБумаги, СтрокаЦенныеБумаги.Рынок, СтрокаЦенныеБумаги.ЦеннаяБумага);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЭтотОбъект.ПереоцениватьЗадолженности Тогда
		ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.Задолженность);
	КонецЕсли;
	Если ЭтотОбъект.ПереоцениватьДепозиты Тогда
		ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.ДепозитныеВклады);
	КонецЕсли;
	Если ЭтотОбъект.ПереоцениватьМНО Тогда
		ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.МНО);
	КонецЕсли;
	Если ЭтотОбъект.ВосстанавливатьРезервПоРасчетнымБрокерскимИКлиринговымСчетам Тогда
		ДобавитьДвижениеПорученияНаПереоценку(Перечисления.ВидыАктивовДляПорученийНаПереоценку.РезервПоРасчетнымБрокерскимИКлиринговымСчетам);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьИзФайла(АдресФайла, Отказ) Экспорт

	ПутьКФайлу				= ПолучитьИмяВременногоФайла("xml");
	УдалитьФайлПослеЧтения	= Истина;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанные.Записать(ПутьКФайлу);
		
	
	МассивISIN = Новый Массив;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);

	ПостроительDOM	= Новый ПостроительDOM;
	ДокументDOM		= ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();

	Если УдалитьФайлПослеЧтения Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;	
	
	Элемент			= ДокументDOM.ЭлементДокумента;
	Разыменователь	= Новый РазыменовательПространствИменDOM(Элемент);
	ВыборкаXPath	= ДокументDOM.ВычислитьВыражениеXPath("//СправедливаяСтоимость[@Дата=""" + Формат(ЭтотОбъект.Дата, "ДФ=yyyy-MM-ddT00:00:00") + """]/ЦеннаяБумага", Элемент, Разыменователь);

	Пока Истина Цикл

		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли; 
		
		Для Каждого Узел Из ЭлементDOM.ДочерниеУзлы Цикл
			Если Узел.ИмяУзла = "ISIN" Тогда
				МассивISIN.Добавить(Узел.ТекстовоеСодержимое);
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла;
	
	Если МассивISIN.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при загрузке поручения на переоценку из файла клиента: не обнаружены данные на " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"),,,, Отказ);
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыВТорговыхСистемах.Объект КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦБизФайла
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах КАК КодыВТорговыхСистемах
		|ГДЕ
		|	КодыВТорговыхСистемах.ВидКода В (ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN), ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий))
		|	И КодыВТорговыхСистемах.Код В (&МассивISIN)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстатки.Рынок КАК Рынок
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиЦенныхБумагОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЦБизФайла КАК _ЦБизФайла
		|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = _ЦБизФайла.ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("МассивISIN", МассивISIN);
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	ЭтотОбъект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЭтотОбъект.ЦенныеБумаги.Количество() = 0 Тогда
		ЭтотОбъект.ПереоцениватьЦенныеБумаги = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
